name = input('Напишите своё имя:') + ','
last_name = input('Напишите свою фамилию:')
year = int(input('Напишите год своего рождения:'))
age = 2023 - year

print(last_name , name, age )

# Напишите своё имя:Виктор
# Напишите свою фамилию:Белокобыльский
# Напишите год своего рождения:1991
# Белокобыльский Виктор, 32